Revit 2026 API

# AnalysisDisplayColorSettingsSetIntermediateColors Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetIntermediateColors(
	IList<AnalysisDisplayColorEntry> map
)
```
```vb
Public Sub SetIntermediateColors (
	map As IList(Of AnalysisDisplayColorEntry)
)
```
```cpp
public:
void SetIntermediateColors(
	IList<AnalysisDisplayColorEntry^>^ map
)
```
```fsharp
member SetIntermediateColors :
        map : IList<AnalysisDisplayColorEntry> -> unit
```

#### Parameters

map IListAnalysisDisplayColorEntry

#### Reference

AnalysisDisplayColorSettings Class

Autodesk.Revit.DB.Analysis Namespace